{
  "head": {
    "name": "นาย ศุภกร แรงกสิวิทย์",
    "job": "Senior Programmer",
    "download": "ดาวน์โหลดเรซูเม่",
    "email": "Jamesupakorn007@gmail.com",
    "phone": "(+66)93-7720044",
    "facebook": "Supakorn Raengkasiwit",
    "line": "manofmoon"
  },
  "tabs": {
    "Personal": "ประวัติส่วนตัว",
    "Study": "ประวัติการศึกษา",
    "Work": "ประวัติการทำงาน",
    "Other": "ประวัติอื่นๆ"
  },
  "Lang": "ภาษา",
  "Skill": {
  "Skill": "ทักษะ",
  "Level5": "ระดับเชี่ยวชาญพิเศษ",
  "Level4": "ระดับเชี่ยวชาญ",
  "Level3": "ระดับสูง",
  "Level2": "ระดับกลาง",
  "Level1": "ระดับพื้นฐาน",
  "JavaServerPages": "JavaServer Pages (JSP)",
  "JavaScript": "JavaScript",
  "HTML5": "HTML5",
  "CSS": "Cascading Style Sheets (CSS)",
  "Bootstrap": "Bootstrap",
  "Java": "Java",
  "CSharpDotNet": "C#/.NET Framework",
  "SpringBoot": "Spring Boot",
  "React": "React",
  "Python": "Python",
  "DotNetCoreMVC": ".NET Core MVC",
  "AngularJS": "AngularJS",
  "ReactNative": "React Native"
  },
  "StudyHis": {
    "Primary": "จบประถม",
    "Junior": "จบมัธยมต้น",
    "Vocational": "ปวช. คอมพิวเตอร์ธุรกิจ",
    "HighVocational": "ปวส. คอมพิวเตอร์ธุรกิจ",
    "Bachelor": "ปริญญาตรี ระบบสารสนเทศ",
    "SchoolPrimary": "โรงเรียนวัดมะพร้าวเตี้ย",
    "SchoolJunior": "โรงเรียนโพธิสารพิทยากร",
    "SchoolVocational": "วิทยาลัยพณิชยการธนบุรี",
    "SchoolBachelor": "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร"
  },
  "Personal": {
    "Personal": "ข้อมูลส่วนตัว",
    "Height": "ส่วนสูง",
    "Weight": "น้ำหนัก",
    "Age": "อายุ",
    "Military": "สถานภาพทางทหาร",
    "Address": "ที่อยู่ปัจจุบัน",
    "Exempted": "ได้รับการยกเว้น",
    "cm": "ซ.ม.",
    "kg": "ก.ก.",
    "Year": "ปี",
    "addReal": "333/1 หมู่2 ต.บางบัวทอง อ.บางบัวทอง จ.นนทบุรี 11110"
  },
  "WorkEx": {
    "DetailBtn" : "คลิกเพื่อดูรายละเอียด",
    "Year1": "พฤษภาคม 2567 – ปัจจุบัน",
    "Company1": "Entronica Co., Ltd.",
    "Position1": "Sr. Programmer",
    "Responsibility1": "รับผิดชอบงานด้าน Backend โดยใช้ Java Spring Boot ในการพัฒนาและขึ้นระบบใหม่ทั้งหมด รวมถึงทำหน้าที่เป็นที่ปรึกษาหลักให้กับทีม ทำให้การแก้ปัญหาเป็นไปอย่างรวดเร็วและช่วยเพิ่มประสิทธิภาพการทำงานโดยรวม",
    "Year2": "พฤศจิกายน 2566 – เมษายน 2567",
    "Company2": "INTERNATIONAL RESEARCH CORPORATION",
    "Position2": "Project Management Office",
    "Responsibility2": "ดูแลและควบคุมการส่งมอบงานโปรแกรมให้เป็นไปตามกำหนดเวลาที่วางแผนไว้ และตรวจสอบความถูกต้องของงานอย่างเข้มงวด ช่วยให้สามารถลดความเสี่ยงของความล่าช้าในการส่งมอบโปรเจกต์ได้เป็นอย่างดี",
    "Year3": "มิถุนายน 2564 – พฤศจิกายน 2566",
    "Company3": "myHR Corporation Limited",
    "Position3": "Web Developer",
    "Responsibility3": "พัฒนาและออกแบบระบบจัดการทรัพยากรบุคคล (HRM) ทั้งในส่วน Backend และ Frontend โดยใช้ JSP และ Framework ภายในบริษัทเป็นหลัก รวมถึงใช้ AngularJS และ JavaScript ในการทำงานร่วมกัน ซึ่งช่วยเพิ่มประสิทธิภาพและความสามารถของระบบให้ทำงานได้อย่างสมบูรณ์",
    "Year4": "ธันวาคม 2561 – พฤษภาคม 2564",
    "Company4": "บริษัท สุพรีมโพดักซ์ จำกัด",
    "Position4": "Programmer",
    "Responsibility4": "พัฒนาโปรแกรมและแอปพลิเคชันหลากหลายประเภท โดยมีผลงานที่โดดเด่นดังนี้:\n- โปรแกรมดูกล้องในรถพยาบาล: พัฒนาระบบแสดงข้อมูลอุปกรณ์สำคัญ เช่น กล้อง, GPS, และสัญญาณชีพแบบ Real-time ทั้งแบบรายคันและภาพรวม เพื่อให้แพทย์และทีมฉุกเฉินสามารถประเมินสถานการณ์ได้อย่างแม่นยำและรวดเร็ว\n- โปรแกรมเรียกคิว: สร้างระบบจัดการคิวผู้ป่วยที่สามารถจัดลำดับความเร่งด่วนและแสดงผลพร้อมเสียงเรียก เพื่อลดระยะเวลาการรอคอยและเพิ่มความราบรื่นในการให้บริการ\n- โปรแกรม Tele Phama: พัฒนาแพลตฟอร์มวิดีโอคอลสำหรับเภสัชกร เพื่อส่งข้อมูลผู้ป่วยและข้อมูลยาระหว่างโรงพยาบาลจังหวัดและโรงพยาบาลส่วนตำบล ทำให้การให้คำปรึกษาด้านยาเป็นไปอย่างแม่นยำและทันท่วงที\n- โปรแกรม EMS Bot: พัฒนาโปรแกรมสื่อสารวิดีโอคอลบนอุปกรณ์ EMS Bot ที่สามารถส่งข้อมูลสัญญาณชีพและข้อมูลการแสกนสมองไปยังห้องฉุกเฉินได้ทันที ช่วยให้แพทย์สามารถตัดสินใจและวางแผนการรักษาได้อย่างรวดเร็ว\n- ระบบแชทบอท: พัฒนาและติดตั้งระบบแชทบอทอัตโนมัติทั้งแบบข้อความและเสียง เพื่อเพิ่มช่องทางการสื่อสารกับผู้ใช้งานและลดภาระงานในการตอบคำถามซ้ำๆ ของทีมงาน",
    "Year5": "พฤษภาคม 2560 – พฤศจิกายน 2561",
    "Company5": "วิทยาลัยพณิชยการธนบุรี",
    "Position5": "เจ้าหน้าที่ธุรการ",
    "Responsibility5": "ทำหน้าที่เป็น IT Support เป็นเวลา 6 เดือน ก่อนย้ายมาดูแลงานวิจัยและจัดทำเอกสารราชการต่างๆ ซึ่งช่วยพัฒนาทักษะด้านการจัดทำเอกสารและการบริหารจัดการข้อมูล",
    "Year6": "มีนาคม 2559 – เมษายน 2560",
    "Company6": "ธนาคารไทยเครดิตเพื่อรายย่อย",
    "Position6": "เจ้าหน้าที่แนะนำสินเชื่อ",
    "Responsibility6": "แนะนำผลิตภัณฑ์สินเชื่อและบริหารจัดการหนี้จากการปล่อยสินเชื่อ ทำให้มีประสบการณ์ด้านการสื่อสารและโน้มน้าวลูกค้า รวมถึงการบริหารความสัมพันธ์กับลูกค้า"
  }
}
